InformationRegisters/ПодборКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПодборКурьераКЗаказу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветКурьера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодбораКурьераКЗаказу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыПодбораКурьеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПодбораКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПодбораКурьераКЗаказу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БеруВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеБеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииДоставкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборКурьера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/МенеджерРегламентныхЗаданий/Ext/Module.bsl
Процедура ПодборКурьеровКЗаказу() Экспорт 
	// заявки по стадиям: основные, готовые с приоритетом, готовые, отменить заказ
	// между стадиями - по n минут  
	// только для заказов, у которых не подобран курьер
	
	
	//МенеджерЗаписи = РегистрыСведений.ОТЛАДКА.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.ТекДата = ТекущаяДата();
	//МенеджерЗаписи.Текст = "ОПА";
	//МенеджерЗаписи.Записать(); 	
КонецПроцедуры

Процедура КонтрольОпаздывающихКурьеров() Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодборКурьераКЗаказу.СрезПоследних КАК ПодборКурьераКЗаказуСрезПоследних
		|		ПО Заказы.Ссылка = ПодборКурьераКЗаказуСрезПоследних.Заказ
		|ГДЕ
		|	ПодборКурьераКЗаказуСрезПоследних.ОтветКурьера = ЗНАЧЕНИЕ(Перечисление.СтатусыПодбораКурьераКЗаказу.БеруВРаботу)
		|	И Заказы.Состояние = ЗНАЧЕНИЕ(Перечисление.СтадииДоставкиЗаказа.Начат)
		|	И РАЗНОСТЬДАТ(ПодборКурьераКЗаказуСрезПоследних.Период, &ТекущееВремя, МИНУТА) >= 60";
	Запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
		ЗаказОбъект.Состояние = Перечисления.СтадииДоставкиЗаказа.Задерживается;
		ЗаказОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
